{   
    "name" : "Reclaiming the Valley",
    "description" : "3000 years ago I began my life in this realm. Born to a poor widow in the Kingdom of Ahll, my life was worthless in the eyes of many. My mother spent countless hours every day, begging for scrap in the marketplace, while I worked long hours in the smithshops. My existence amounted to nothing, traveler. As I grew up, I became very fond of the valley. Something about the way it looked, and felt. Like many others before me, I became obsessed with its power, I wanted it for myself. I began leaving the kingdom in the evenings, and venturing out into the valley to explore. For years I did this, finding nothing and slowly driving myself toward insanity One evening, during a seemingly ordinary stroll through the valley, I stumbled upon a harmless Nepian youngling holding some oddly shaped stone-like object. The Nepian was engulfed in red hot flame, and had a deep gash running from the base of its left arm up to its throat. As I approached, it violently jerked its gaze away from the idol and toward my direction. Then I saw it. The Nepians eyes were electric blue, dull and lifeless, almost as If someone had poured a can of white paint onto an electric blue canvas. Foam dripped from its mouth, and its movement was erratic and indecisive. I noticed that whatever it was that this Nepian was holding looked like it was leeching this electric blue energy into it. Startled, I took a sudden step back and reached for my dirk. Before I could grab it, it lunged for me. In an instant, I felt its clammy hands wrap around my leg, followed by the razor sharp slices of mangled teeth digging into my nerves. I screamed out in pain and began to wildly thrash around the vicinity. After a couple of seconds, I was able to regain some focus, and managed to grab the youngling and throw it off of me. As it began to stand, and ready for a second attack, I took my chance and began slashing at their torso. It stumbled back, and a foul smelling liquid began oozing out of the wounds. After a few seconds, it collapsed, and exhaled a last breath. As I approached the corpse, I noticed the stone-like object skewed a few feet away from it. Interested, I began to reach for it. As I grabbed it, I felt a strange energy begin to course through my body. I felt powerful; awake. Since then I have never felt further away from death. It's quite nice, actually. You see, Traveler, the idol was never lost. I have had it the entire time. I do indeed, enjoy a good story though! Traveler, I hope you are not upset with me for wasting your time.",
    "requirements" : "Xavius Silverleaf wants you to kill 1000 Nepian Scouts",
    "completiontext" : "I expect this will take you some time...",
    "questdata" : {
        "questnumber": 5,
        "verb" : "kill",
        "type" : "Nepian Scout",
        "ammount" : 1
    }
}