{   
    "quest_number": 1,
    "name" : "Trouble in the Infinite Flux",
    "description" : "Greetings traveler, my name is ___. I have lived in this valley for decades now and watched it grow and prosper over the years. However, the past several years have been harsh. Traveler, you must know something: THIS VALLEY IS CURSED.Almost a millennium ago, there existed two great civilizations just outside the valley. For centuries, they prospered and flourished as separate entities. As the civilizations existed, they were able to feed off of the fertile valley, resulting in rapid technological advancements. The more the two civilizations reaped the bounties of the land, the more it seemed to give.Although the land was bountiful and the two civilizations had more than they needed to continue to thrive and prosper, they became greedy and began to compete with each other for the resources the valley provided.WAR ERUPTED and the two civilizations found themselves in a clash lasting centuries. It seemed all hope was lost. The two civilizations were facing inevitable collapse.As the civilizations approached their grave ends, something remarkable happened. A group of citizen soldiers from one of the civilizations stumbled upon an IDOL in the lower right region of the valley. They quickly collected the idol and returned to their civilization, where the idol was presented to the leader.The leader spent some time examining the idol, to which they concluded that it was RESPONSIBLE FOR THE VALLEYS ENDLESS SUPPLY OF RESOURCES.Filled with despair from the inevitable collapse of their civilization, the leader decided to ATTEMPT TO DESTROY THE IDOLThe attempts were extensive and thorough, but none were successful. As a last hope attempt, the leader came to the valley seeking advice from an old hermit who had been there since before they could remember. The hermit spoke with the leader and said that they could destroy their idol, but they would need to do it alone. So, the hermit traveled to a location which is still unknown to this day, and began their attempt to destroy the idol.No one knows whether or not he destroyed it, but the land has never produced like it did before the day the hermit left.So, the civilizations eventually stopped the warfare as famine and drought struck them both. The valley's lack of fertility proved to be too much, and both civilizations died off. Since then, nothing or no one has been able to survive here for very long. Traveler, If you are willing, I think that I know how to begin investigating this curse. I am too old and frail now to do it myself, but you seem to be perfect for the task. There are some mysterious herbs growing in the valley, just near here. Bring me some of them, if you can." , 
    "requirements" : " ___ wants you to collect 10 mysterious plant",
    "completion-text" : "Ah, Traveler, back again? Have you gathered the herbs I asked you to ?", 
    "required-quests" : {
        "num" : 0,
        "name" : "none"
    }
}